//////ПРЕОБРАЗОВНИЕ ТИПОВ ДАННЫХ//////


//ПРИМЕР1 - Преобразование типов данных, преобразование числа в строку
// const age = 10
// console.log(age) // на этой строке выведет число
// console.log(String(age)) // А на этой строке выведет стрингу


//ПРИМЕР2 - Преобразование типов данных, преобразование строки в число
// const str = "1000"
// const num = Number(str)
// console.log(num, typeof num)


//ПРИМЕР3 - Преобразование типов данных,преобразование числа в строку
// let value = 100;
// let strValue = String(value); // Преобразуем число в строку
// console.log(strValue, typeof strValue); // "100" 'string'



//ПРИМЕР4 - Преобразование типов данных
console.log(Number (true)) // Преобразование булевого значения true в число, равняется 1
console.log(Boolean (1)) // Преобразование числа 1 в булевое значение, равняется true